# IdeaStatiCa.ConnectionApi.Model.ConStiffeningMemberOperation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**CrossSectionId** | **int?** |  | [optional]
**MaterialId** | **int?** |  | [optional]
**Length1** | **double** |  | [optional]
**Length2** | **double** |  | [optional]
**MirrorY** | **bool** |  | [optional]
**MirrorZ** | **bool** |  | [optional]
**Positioning** | **ConAddedMemberPositioning** |  | [optional]
**Weld** | **ConWeldData** |  | [optional]
**IsImported** | **bool** |  | [optional]
**OperationType** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)